
![Portada](img/Recurso-6.png)

## 01MIAR - Estructuras de datos, +Pandas

![Python](img/imgPython.jpg)

*Steven Cabascango*

In [28]:
import pandas as pd
import numpy as np

In [29]:
pd.__version__

'2.3.3'

# Operaciones en pandas

#### Búsqueda

In [30]:
rand_matrix = np.random.randint(6,size=(2,3))
frame = pd.DataFrame(rand_matrix , columns=list('ABC'))
display(frame)

   A  B  C
0  2  4  0
1  0  4  4

In [31]:
# buscando columnas (DataFrame como dic, busca en claves)
'A' in frame

True

In [32]:
# buscando valores
display(frame.isin([3,2])) # --> mask de respuesta (valores que son 3 o 2)

       A      B      C
0   True  False  False
1  False  False  False

In [33]:
# Contar el número de ocurrencias
print(frame.isin([4]).values.sum())
display(frame.isin([4])) #devuelve una mask con valores true si el elemento es 4
print(frame.isin([4]).values)
type(frame.isin([4]).values) # pandas es una capa alrededor de numpy

3

       A     B      C
0  False  True  False
1  False  True   True

[[False  True False]
 [False  True  True]]

numpy.ndarray

In [34]:
# Cuántos valores son >= 2
mask = frame >= 2
print(mask.values.sum())
display(mask)

4

       A     B      C
0   True  True  False
1  False  True   True

#### Ordenación

In [35]:
from random import shuffle

rand_matrix = np.random.randint(20,size=(5,4))

indices = list(range(5))
shuffle(indices) # mezcla indices

frame = pd.DataFrame(rand_matrix , columns=list('DACB'), index=indices)
display(frame)

    D   A   C   B
4   7  10  18  19
2   1  14   8   3
1  10   0  13   0
0  11  10   2   3
3  10   2  19  17

In [36]:
# ordenar por índice
display(frame.sort_index(ascending=False))
display(frame)

    D   A   C   B
4   7  10  18  19
3  10   2  19  17
2   1  14   8   3
1  10   0  13   0
0  11  10   2   3

    D   A   C   B
4   7  10  18  19
2   1  14   8   3
1  10   0  13   0
0  11  10   2   3
3  10   2  19  17

In [37]:
#ordenar por columna
display(frame.sort_index(axis=1, ascending=False))

    D   C   B   A
4   7  18  19  10
2   1   8   3  14
1  10  13   0   0
0  11   2   3  10
3  10  19  17   2

In [38]:
# ordenar filas por valor en columna
display(frame.sort_values(by='A', ascending=True))

    D   A   C   B
1  10   0  13   0
3  10   2  19  17
4   7  10  18  19
0  11  10   2   3
2   1  14   8   3

In [39]:
# ordenar columnas por valor en fila
display(frame.sort_values(by=1, axis=1, ascending=True))

    A   B   D   C
4  10  19   7  18
2  14   3   1   8
1   0   0  10  13
0  10   3  11   2
3   2  17  10  19

In [40]:
# ordenar por valor en columna y guardar cambios
frame.sort_values(by='A', ascending=False, inplace=True)
display(frame)

    D   A   C   B
2   1  14   8   3
4   7  10  18  19
0  11  10   2   3
3  10   2  19  17
1  10   0  13   0

#### Ranking
- Construir un ranking de valores

In [41]:
display(frame)

    D   A   C   B
2   1  14   8   3
4   7  10  18  19
0  11  10   2   3
3  10   2  19  17
1  10   0  13   0

In [42]:
display(frame.rank(method='max', axis=1))

     D    A    C    B
2  1.0  4.0  3.0  2.0
4  1.0  2.0  3.0  4.0
0  4.0  3.0  1.0  2.0
3  2.0  1.0  4.0  3.0
1  3.0  2.0  4.0  2.0

In [43]:
# Imprimir, uno a uno, los valores de la columna 'C' de mayor a menor
for x in frame.sort_values(by='C', ascending=False)['C'].values:
    print(x)

19
18
13
8
2

# Operaciones

Operaciones matemáticas entre objetos

In [44]:
matrixA = np.random.randint(100,size=(4,4))
matrixB = np.random.randint(100,size=(4,4))
frameA = pd.DataFrame(matrixA)
frameB = pd.DataFrame(matrixB)
display(frameA)
display(frameB)

    0   1   2   3
0   8  21  27  13
1  88  92  90  26
2   8   7  71  35
3  14  90  45  75

    0   1   2   3
0  22  47  75  27
1  62  32  10  58
2  70  21  34   7
3  65  95  47  79

In [45]:
# a través de métodos u operadores
display(frameA + frameB == frameA.add(frameB))
display(frameA + frameB)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

     0    1    2    3
0   30   68  102   40
1  150  124  100   84
2   78   28  105   42
3   79  185   92  154

In [46]:
display(frameB - frameA == frameB.sub(frameA))
display(frameB - frameA)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

    0   1   2   3
0  14  26  48  14
1 -26 -60 -80  32
2  62  14 -37 -28
3  51   5   2   4

In [47]:
# si los frames no son iguales, valor por defecto NaN
frameC = pd.DataFrame(np.random.randint(100,size=(3,3)))
display(frameA)
display(frameC)
display(frameC + frameA)

    0   1   2   3
0   8  21  27  13
1  88  92  90  26
2   8   7  71  35
3  14  90  45  75

    0   1   2
0  29  41  31
1   3   5  33
2  95  89  79

       0     1      2   3
0   37.0  62.0   58.0 NaN
1   91.0  97.0  123.0 NaN
2  103.0  96.0  150.0 NaN
3    NaN   NaN    NaN NaN

In [48]:
# se puede especificar el valor por defecto con el argumento fill_value
display(frameA.add(frameC, fill_value=0))

       0     1      2     3
0   37.0  62.0   58.0  13.0
1   91.0  97.0  123.0  26.0
2  103.0  96.0  150.0  35.0
3   14.0  90.0   45.0  75.0

Operadores aritméticos solo válidos en elementos aceptables

In [92]:
import pandas as pd

frameA = pd.DataFrame({0:[1,2], 1:[3,4]})
frameD = pd.DataFrame({0:[1,1], 1:[1,2]})

print(frameA - frameD)

   0  1
0  0  2
1  1  2

Operaciones entre Series y DataFrames

In [93]:
rand_matrix = np.random.randint(10, size=(3, 4))
df = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(df)

display(df.iloc[0])
display(type(df.iloc[0]))
# uso común, averiguar la diferencia entre una fila y el resto
display(df - df.iloc[0])
display(df.sub(df.iloc[0], axis=1))
# Por columnas cómo se restaría
display(df.sub(df['A'], axis=0))

   A  B  C  D
0  2  2  5  2
1  8  5  0  6
2  8  7  2  7

A    2
B    2
C    5
D    2
Name: 0, dtype: int32

pandas.core.series.Series

   A  B  C  D
0  0  0  0  0
1  6  3 -5  4
2  6  5 -3  5

   A  B  C  D
0  0  0  0  0
1  6  3 -5  4
2  6  5 -3  5

   A  B  C  D
0  0  0  3  0
1  0 -3 -8 -2
2  0 -1 -6 -1

pandas se basa en NumPy, np operadores binarios y unarios son aceptables 

| Tipo | Operación | Descripción |
|:---------|:-----|:-----|
| Unario | *abs* | Valor absoluto de cada elemento |
| | *sqrt* | Raíz cuadrada de cada elemento |
| | *exp* | e^x, siendo x cad elemento |
| | *log, log10, log2* | Logaritmos en distintas bases de cada elemento |
| | *sign* | Retorna el signo de cada elemento (-1 para negativo, 0 o 1 para positivo) |
| | *ceil* | Redondea cada elemento por arriba |
| | *floor* | Redondea cada elemento por abajo |
| | *isnan* | Retorna si cada elemento es Nan |
| | *cos, sin, tan* | Operaciones trigonométricas en cada elemento |
| | *arccos, arcsin, arctan* | Inversas de operaciones trigonométricas en cada elemento |
| Binario | *add* | Suma de dos arrays |
| | *substract* | Resta de dos arrays |
| | *multiply* | Multiplicación de dos arrays |
| | *divide* | División de dos arrays |
| | *maximum, minimum* | Retorna el valor máximo/mínimo de cada pareja de elementos |
| | *equal, not_equal* | Retorna la comparación (igual o no igual) de cada pareja de elementos |
| | *greater, greater_equal, less, less_equal* | Retorna la comparación (>, >=, <, <= respectivamente) de cada pareja de elementos |

Aplicación de funciones a medida con lambda

In [94]:
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)

print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por columna

   A  B  C  D
0  2  2  4  1
1  7  7  9  9
2  0  7  4  5

0    3
1    2
2    7
dtype: int64

In [95]:
def max_min(x):
    return x.max() - x.min()

print(frame.apply(max_min, axis = 0)) # diferencia por columna

A    7
B    5
C    5
D    8
dtype: int64

In [96]:
# diferencia entre min y max por fila (no columna)
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)

print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por fila

   A  B  C  D
0  4  5  8  2
1  0  9  0  9
2  5  5  5  0

0    6
1    9
2    5
dtype: int64

# Estadística descriptiva
- Análisis preliminar de los datos
- Para Series y DataFrame

| Operación | Descripción |
|:----------|:------------|
| count | Número de valores no NaN |
| describe | Conjunto de estadísticas sumarias|
| min, max | Valores mínimo y máximo |
| argmin, argmax | Índices posicionales del valor mínimo y máximo |
| idxmin, idxmax | Índices semánticos del valor mínimo y máximo |
| sum | Suma de los elementos |
| mean | Media de los elementos |
| median | Mediana de los elementos |
| mad | Desviación absoluta media del valor medio |
| var | Varianza de los elementos |
| std | Desviación estándar de los elementos |
| cumsum | Suma acumulada de los elementos |
| diff | Diferencia aritmética de los elementos |

In [97]:
diccionario = { "nombre" : ["Marisa","Laura","Manuel", "Carlos"], "edad" : [34,34,11, 30], 
               "puntos" : [98,12,98,np.nan], "genero": ["F", "F", "M", "M"] }
frame = pd.DataFrame(diccionario)
display(frame)
display(frame.describe()) # datos generales de elementos

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
1   Laura    34    12.0      F
2  Manuel    11    98.0      M
3  Carlos    30     NaN      M

            edad     puntos
count   4.000000   3.000000
mean   27.250000  69.333333
std    10.996211  49.652123
min    11.000000  12.000000
25%    25.250000  55.000000
50%    32.000000  98.000000
75%    34.000000  98.000000
max    34.000000  98.000000

In [98]:
# operadores básicos
print(frame.sum())

display(frame)
print(frame.sum(axis=1, numeric_only=True))

nombre    MarisaLauraManuelCarlos
edad                          109
puntos                      208.0
genero                       FFMM
dtype: object

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
1   Laura    34    12.0      F
2  Manuel    11    98.0      M
3  Carlos    30     NaN      M

0    132.0
1     46.0
2    109.0
3     30.0
dtype: float64

In [99]:
frame.mean(numeric_only=True)

edad      27.250000
puntos    69.333333
dtype: float64

In [100]:
frame.cumsum()

                    nombre  edad  puntos genero
0                   Marisa    34    98.0      F
1              MarisaLaura    68   110.0     FF
2        MarisaLauraManuel    79   208.0    FFM
3  MarisaLauraManuelCarlos   109     NaN   FFMM

In [101]:
frame.count(axis=1)

0    4
1    4
2    4
3    3
dtype: int64

In [102]:
print(frame['edad'].std())

10.996211468804457

In [103]:
frame['edad'].idxmax()

0

In [104]:
frame['puntos'].idxmin()

1

In [105]:
# frame con las filas con los valores maximos de una columna
print(frame['puntos'].max())

display(frame[frame['puntos'] == frame['puntos'].max()])

98.0

   nombre  edad  puntos genero
0  Marisa    34    98.0      F
2  Manuel    11    98.0      M

In [106]:
frame["ranking"] = frame["puntos"].rank(method='max')

In [107]:
display(frame)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    34    12.0      F      1.0
2  Manuel    11    98.0      M      3.0
3  Carlos    30     NaN      M      NaN

## Agregaciones

In [108]:
display(frame)
df = frame.groupby('genero').count()
display(df)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    34    12.0      F      1.0
2  Manuel    11    98.0      M      3.0
3  Carlos    30     NaN      M      NaN

        nombre  edad  puntos  ranking
genero
F            2     2       2        2
M            2     2       1        1

In [109]:
# si es Nan descarta la fila
df = frame.groupby('puntos').count()
display(df)

        nombre  edad  genero  ranking
puntos
12.0         1     1       1        1
98.0         2     2       2        2

In [110]:
display(frame.groupby('genero').mean(numeric_only=True))

        edad  puntos  ranking
genero
F       34.0    55.0      2.0
M       20.5    98.0      3.0

In [111]:
display(frame.groupby('genero').max())

        nombre  edad  puntos  ranking
genero
F       Marisa    34    98.0      3.0
M       Manuel    30    98.0      3.0

In [112]:
# funciones de agregación de varias columnas para obtener distintos estadísticos
display(frame.groupby('genero')[['edad', 'puntos']].aggregate(['min', 'mean', 'max']))

       edad           puntos
        min  mean max    min  mean   max
genero
F        34  34.0  34   12.0  55.0  98.0
M        11  20.5  30   98.0  98.0  98.0

In [113]:
# Filtrado de los datos en el que el conjunto no supera una media determinada 
def media(x):
    return x["edad"].mean() > 30

display(frame)
frame.groupby('genero').filter(media)

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    34    12.0      F      1.0
2  Manuel    11    98.0      M      3.0
3  Carlos    30     NaN      M      NaN

   nombre  edad  puntos genero  ranking
0  Marisa    34    98.0      F      3.0
1   Laura    34    12.0      F      1.0

## Correlaciones

pandas incluye métodos para analizar correlaciones
- Relación matemática entre dos variables (-1 negativamente relacionadas, 1 positivamente relacionadas, 0 sin relación)
- obj.corr(obj2) --> medida de correlación entre los datos de ambos objetos
- https://blogs.oracle.com/ai-and-datascience/post/introduction-to-correlation

### Ejemplo Fuel efficiency
- https://archive.ics.uci.edu/ml/datasets/Auto+MPG

In [114]:
import pandas as pd
path = 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data'

mpg_data = pd.read_csv(path, sep='\s+', header=None,
            names = ['mpg', 'cilindros', 'desplazamiento','potencia',
            'peso', 'aceleracion', 'año', 'origen', 'nombre'],
            na_values='?', engine='c')

In [115]:
display(mpg_data.sample(5))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
221,17.5,8,305.0,145.0,3880.0,12.5,77,1,chevrolet caprice classic
166,13.0,8,302.0,129.0,3169.0,12.0,75,1,ford mustang ii
372,27.0,4,151.0,90.0,2735.0,18.0,82,1,pontiac phoenix
104,12.0,8,400.0,167.0,4906.0,12.5,73,1,ford country
112,19.0,4,122.0,85.0,2310.0,18.5,73,1,ford pinto

In [116]:
display(mpg_data.describe(include='all'))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000,NaN

In [117]:
mpg_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   mpg             398 non-null    float64
 1   cilindros       398 non-null    int64
 2   desplazamiento  398 non-null    float64
 3   potencia        392 non-null    float64
 4   peso            398 non-null    float64
 5   aceleracion     398 non-null    float64
 6   año             398 non-null    int64
 7   origen          398 non-null    int64
 8   nombre          398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB

### Correlaciones entre valores

In [118]:
mpg_data['mpg'].corr(mpg_data['peso']) # + mpg = - peso

np.float64(-0.8317409332443345)

In [119]:
mpg_data['peso'].corr(mpg_data['aceleracion']) # + peso = - aceleracion

np.float64(-0.41745731994039326)

### Correlaciones entre todos los valores

In [120]:
mpg_data.corr(numeric_only=True)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen
mpg,1.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289,0.579267,0.563450
cilindros,-0.775396,1.000000,0.950721,0.842983,0.896017,-0.505419,-0.348746,-0.562543
desplazamiento,-0.804203,0.950721,1.000000,0.897257,0.932824,-0.543684,-0.370164,-0.609409
potencia,-0.778427,0.842983,0.897257,1.000000,0.864538,-0.689196,-0.416361,-0.455171
peso,-0.831741,0.896017,0.932824,0.864538,1.000000,-0.417457,-0.306564,-0.581024
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,1.000000,0.288137,0.205873
año,0.579267,-0.348746,-0.370164,-0.416361,-0.306564,0.288137,1.000000,0.180662
origen,0.563450,-0.562543,-0.609409,-0.455171,-0.581024,0.205873,0.180662,1.000000

In [121]:
#año y origen no parecen correlacionables
#eliminar columnas de la correlacion
corr_data = mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True)
display(corr_data)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion
mpg,1.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289
cilindros,-0.775396,1.000000,0.950721,0.842983,0.896017,-0.505419
desplazamiento,-0.804203,0.950721,1.000000,0.897257,0.932824,-0.543684
potencia,-0.778427,0.842983,0.897257,1.000000,0.864538,-0.689196
peso,-0.831741,0.896017,0.932824,0.864538,1.000000,-0.417457
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,1.000000

In [122]:
# representación gráfica matplotlib
import matplotlib.pyplot as plt

In [123]:
# representación gráfica
corr_data.style.background_gradient(cmap=plt.get_cmap('RdYlGn'), axis=1)

In [124]:
# correlación más negativa
mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True).idxmin()

mpg                   peso
cilindros              mpg
desplazamiento         mpg
potencia               mpg
peso                   mpg
aceleracion       potencia
dtype: object

In [125]:
# correlación más positiva
mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True).idxmax()  #consigo misma....

mpg                          mpg
cilindros              cilindros
desplazamiento    desplazamiento
potencia                potencia
peso                        peso
aceleracion          aceleracion
dtype: object

In [126]:
# tabla similar con las correlaciones más positivas (evitar parejas del mismo valor)
positive_corr = mpg_data.drop(['año','origen'],axis=1).corr(numeric_only=True)
np.fill_diagonal(positive_corr.values, 0)
display(positive_corr)
positive_corr.idxmax()

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion
mpg,0.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289
cilindros,-0.775396,0.000000,0.950721,0.842983,0.896017,-0.505419
desplazamiento,-0.804203,0.950721,0.000000,0.897257,0.932824,-0.543684
potencia,-0.778427,0.842983,0.897257,0.000000,0.864538,-0.689196
peso,-0.831741,0.896017,0.932824,0.864538,0.000000,-0.417457
aceleracion,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,0.000000

mpg                  aceleracion
cilindros         desplazamiento
desplazamiento         cilindros
potencia          desplazamiento
peso              desplazamiento
aceleracion                  mpg
dtype: object

In [127]:
positive_corr.style.background_gradient(cmap=plt.get_cmap('RdYlGn'), axis=1, vmin=-1.0, vmax=1.0)

## Ejercicios

- Ejercicios para practicar Pandas: https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb

2. Imprima la versión de pandas que se ha importado.

In [128]:
import pandas as pd

print(pd.__version__)

2.3.3

4 Cree un DataFrame df a partir de estos datos del diccionario que tienen las etiquetas de índice.

In [129]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["Quito", "Guayaquil", "Cuenca"]
}

df = pd.DataFrame(data, index=["a", "b", "c"])

print(df)

      Name  Age       City
a    Alice   25      Quito
b      Bob   30  Guayaquil
c  Charlie   35     Cuenca

6. Devuelve las primeras 3 filas del DataFrame df.

In [130]:
print(df.head(3))

      Name  Age       City
a    Alice   25      Quito
b      Bob   30  Guayaquil
c  Charlie   35     Cuenca

8. Seleccione los datos en las filas [3, 4, 8] y en las columnas ['animal', 'edad'].

In [131]:
import pandas as pd

df = pd.DataFrame({
    'animal': ['cat', 'dog', 'snake', 'cow', 'horse', 'sheep', 'lion', 'tiger', 'bear'],
    'edad': [2, 5, 3, 7, 4, 6, 8, 9, 10]
})

df.loc[[3, 4, 8], ['animal', 'edad']]

  animal  edad
3    cow     7
4  horse     4
8   bear    10

10. Seleccione las filas donde falta la edad, es decir, es NaN.

In [132]:
df[df['edad'].isna()]

Empty DataFrame
Columns: [animal, edad]
Index: []

12. Seleccione las filas cuya edad esté entre 2 y 4 (inclusive).

In [133]:
df[df['edad'].between(2, 4)]

  animal  edad
0    cat     2
2  snake     3
4  horse     4

14. Calcula la suma de todas las visitas en gl (es decir, encuentra el número total de visitas).

In [134]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'animal': ['cat', 'dog', 'snake', 'cow', 'horse', 'sheep', 'lion', 'tiger', 'bear'],
    'edad': [2, 5, 3, 7, 4, 6, 8, 9, 10],
    'visitas': [1, 2, 3, 4, 5, 6, 7, 8, 9]
})

int(df['visitas'].sum())

45

16. Añada una nueva fila 'k' a df con los valores que elija para cada columna. Luego, elimine esa fila para devolver el DataFrame original.

In [135]:

df.loc['k'] = ['elephant', 12, 5]
print(df)
df = df.drop('k')
print(df)

     animal  edad  visitas
0       cat     2        1
1       dog     5        2
2     snake     3        3
3       cow     7        4
4     horse     4        5
5     sheep     6        6
6      lion     8        7
7     tiger     9        8
8      bear    10        9
k  elephant    12        5
  animal  edad  visitas
0    cat     2        1
1    dog     5        2
2  snake     3        3
3    cow     7        4
4  horse     4        5
5  sheep     6        6
6   lion     8        7
7  tiger     9        8
8   bear    10        9

18. Ordene df primero por los valores en la columna 'edad' en orden descendente, luego por el valor en la columna 'visitas' en orden ascendente (por lo que la fila i debe ser la primera y la fila d debe ser la última).

In [136]:
df = df.sort_values(by=['edad', 'visitas'], 
ascending=[False, True])

print(df)

  animal  edad  visitas
8   bear    10        9
7  tiger     9        8
6   lion     8        7
3    cow     7        4
5  sheep     6        6
1    dog     5        2
4  horse     4        5
2  snake     3        3
0    cat     2        1

20. En la columna "animal", cambie las entradas "serpiente" a "pitón".

In [137]:
df['animal'] = df['animal'].replace('serpiente', 'pitón')
print(df)

  animal  edad  visitas
8   bear    10        9
7  tiger     9        8
6   lion     8        7
3    cow     7        4
5  sheep     6        6
1    dog     5        2
4  horse     4        5
2  snake     3        3
0    cat     2        1

GITHUB: https://github.com/Steven-tec/machine-learning.git